Infineon/CyScope/ScopeKitProg/Scope_KitProg.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.3
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2019 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "CyTriggerClock.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ADC_2.h"
#include "ADC_1.h"
#include "USBUART.h"
#include "USBUART_audio.h"
#include "USBUART_cdc.h"
#include "USBUART_hid.h"
#include "USBUART_midi.h"
#include "USBUART_pvt.h"
#include "USBUART_cydmac.h"
#include "USBUART_msc.h"
#include "Scope_A_aliases.h"
#include "Scope_A.h"
#include "Scope_B_aliases.h"
#include "Scope_B.h"
#include "SampleClock.h"
#include "ADCClock.h"
#include "Trigger_Comp.h"
#include "Vtrigger.h"
#include "Amux_Trigger.h"
#include "Trigger_Control.h"
#include "DMA_Channel_1_dma.h"
#include "DMA_Channel_2_dma.h"
#include "PWM_Sample_Buffer.h"
#include "Trigger_Status.h"
#include "External_Trigger_aliases.h"
#include "External_Trigger.h"
#include "Wave_DAC.h"
#include "Wave_Buf.h"
#include "Wave_Out_aliases.h"
#include "Wave_Out.h"
#include "Wave_Clock.h"
#include "PRS.h"
#include "Wave_Control.h"
#include "Noise_Clock.h"
#include "Scope_B_Gnd_aliases.h"
#include "Scope_B_Gnd.h"
#include "Trig_Out_aliases.h"
#include "Trig_Out.h"
#include "Trig_Buf.h"
#include "Bootloadable.h"
#include "Wave_Gnd_aliases.h"
#include "Wave_Gnd.h"
#include "ADC_2_IRQ.h"
#include "ADC_2_Bypass_aliases.h"
#include "ADC_2_Bypass.h"
#include "ADC_1_IRQ.h"
#include "ADC_1_Bypass_aliases.h"
#include "ADC_1_Bypass.h"
#include "USBUART_Dm_aliases.h"
#include "USBUART_Dm.h"
#include "USBUART_Dp_aliases.h"
#include "USBUART_Dp.h"
#include "Wave_DAC_Wave1_DMA_dma.h"
#include "Wave_DAC_Wave2_DMA_dma.h"
#include "Wave_DAC_VDAC8.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

